“For me it is romance and love… right?” - Zlatan
“Nobody expects a footballer to have any kind of an IQ, which is a bit of an unfair stereotype.” - Frank Lampard
“I don’t want to earn my living; I want to live.” - Oscar Wilde
“Things don't have to change the world to be important.” - Steve Jobs
“I want to put a ding in the universe.” - Steve Jobs
“My hairstyle role model is Manuel Neuer. His hair is always perfect.” — Bastian Schweinsteiger
“If we perform as a unit and if every single player gives it his very best, everything can happen.” - Oliver Kahn
“I have never seen a player as weird as me.” — Thomas Müller
"In football as in watchmaking, talent and elegance mean nothing without rigour and precision." - Lionel Messi
"When Students cheat on exams it's because our School System values grades more than Students value learning." - Neil Degrasse Tyson
"We ask 18-year-olds to make huge decisions about their career and financial future, when a month ago they had to ask to go to the bathroom." - Adam Kotsko
“A world where it is safe to love is a world where it is safe to live” ― Serena Anderlini-D'Onofrio
“Our biological body itself is a form of hardware that needs re-programming through tantra like a new spiritual software which can release or unblock its potential.” ― Slavoj Žižek
“Sex is the alpha and enlightenment is the omega. Sex is the first step of the spiritual journey, and enlightenment is the last step of the spiritual journey.” ― Swami Dhyan Giten
“Live, travel, adventure, bless, and don't be sorry.” ― Jack Kerouac
“There was nowhere to go but everywhere, so just keep on rolling under the stars.” ― Jack Kerouac
“Nothing behind me, everything ahead of me, as is ever so on the road.” ― Jack Kerouac
“My fault, my failure, is not in the passions I have, but in my lack of control of them.” ― Jack Kerouac
“Don't use the phone. People are never ready to answer it. Use poetry.” ― Jack Kerouac
"I saw the best minds of my generation destroyed by madness, starving hysterical naked." - Allen Ginsberg
“We are actually fourth dimensional beings in a third dimensional body inhabiting a second dimensional world!” ― Neal Cassady
“Sometimes I sits and thinks. Other times I sits and drinks, but mostly I just sits.” ― Neal Cassady
"I find that a duck’s opinion of me is very much influenced over whether or not I have bread." - Mitch Hedberg
“Through psychedelics we are learning that God is not an idea, God is a lost continent in the human mind.” - Terence Mckenna
“LSD stands out for learning to slow down.” ― Santosh Kalwar
"I grin at the idea of using my sacred powers on the female soul that crosses my path in human form, everyone deserves to know that the heights of human pleasure are not contained in the body but felt by the soul." - IAmNameless
"I am so happy that today happened." - IAmNameless
"Nothing matters." - Jonkavar Allen Grant